AI_Debug/Catalogs/AI_Обращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>AI_Обращения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Досье</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>260</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AI_Debug/CommonModules/AI_Support/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает обращение пользователя с автодосье.
//
// Параметры:
//   Тема - Строка - тема обращения;
//   ТекстСообщения - Строка - первое сообщение пользователя, может быть пустым;
//   Контекст - Неопределено, Структура - см. КонтекстИзСсылки().
//
// Возвращаемое значение:
//   Строка - GUID созданного обращения.
//
Функция СоздатьОбращение(Тема, ТекстСообщения, Контекст = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НовоеОбращение = Справочники.AI_Обращения.СоздатьЭлемент();
	НовоеОбращение.Наименование = ?(ПустаяСтрока(Тема),
		"Обращение от " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT"), Тема);
	НовоеОбращение.Статус = "Новое";
	НовоеОбращение.ДатаСоздания = ТекущаяДатаСеанса();
	НовоеОбращение.ПользовательИмя = ИмяТекущегоПользователя();

	Если Контекст <> Неопределено Тогда
		НовоеОбращение.КонтекстТип = Контекст.Тип;
		НовоеОбращение.КонтекстGUID = Контекст.ГУИД;
		НовоеОбращение.КонтекстСсылка = Контекст.НавигационнаяСсылка;
	КонецЕсли;

	НовоеОбращение.Досье = СобратьДосье();

	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		СтрокаСообщения = НовоеОбращение.Сообщения.Добавить();
		СтрокаСообщения.Период = ТекущаяДатаСеанса();
		СтрокаСообщения.Автор = "user";
		СтрокаСообщения.Текст = ТекстСообщения;
	КонецЕсли;

	НовоеОбращение.Записать();
	Возврат Строка(НовоеОбращение.Ссылка.УникальныйИдентификатор());

КонецФункции

// Разбирает навигационную ссылку 1С (e1cib/data/...) в контекст объекта.
//
// Параметры:
//   СтрокаСсылки - Строка - навигационная ссылка или пустая строка.
//
// Возвращаемое значение:
//   Неопределено - ссылка пустая;
//   Структура - Тип, ГУИД, НавигационнаяСсылка.
//
Функция КонтекстИзСсылки(СтрокаСсылки) Экспорт

	Если ПустаяСтрока(СокрЛП(СтрокаСсылки)) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Контекст = Новый Структура("Тип, ГУИД, НавигационнаяСсылка", "", "", СокрЛП(СтрокаСсылки));

	Маркер = "e1cib/data/";
	ПозицияМаркера = СтрНайти(СтрокаСсылки, Маркер);
	Если ПозицияМаркера = 0 Тогда
		Возврат Контекст;
	КонецЕсли;

	Хвост = Сред(СтрокаСсылки, ПозицияМаркера + СтрДлина(Маркер));
	ПозицияRef = СтрНайти(Хвост, "?ref=");
	Если ПозицияRef = 0 Тогда
		Контекст.Тип = Хвост;
		Возврат Контекст;
	КонецЕсли;

	Контекст.Тип = Лев(Хвост, ПозицияRef - 1);
	ХексСсылки = Сред(Хвост, ПозицияRef + 5, 32);
	Если СтрДлина(ХексСсылки) = 32 Тогда
		Контекст.ГУИД = ГУИДИзХексСсылки(ХексСсылки);
	КонецЕсли;

	Возврат Контекст;

КонецФункции

// Преобразует 32-символьное hex-представление ссылки из навигационной ссылки в GUID.
// Порядок блоков в навссылке обратный: последние 8 байт, затем группы 2, 2 и 4 байта
// (проверено на живой базе раном ai-support-mvp1).
//
// Параметры:
//   ХексСсылки - Строка - 32 шестнадцатеричных символа (порядок байт 1С).
//
// Возвращаемое значение:
//   Строка - GUID в каноническом виде.
//
Функция ГУИДИзХексСсылки(ХексСсылки) Экспорт

	Возврат НРег(
		Сред(ХексСсылки, 25, 8)
		+ "-" + Сред(ХексСсылки, 21, 4)
		+ "-" + Сред(ХексСсылки, 17, 4)
		+ "-" + Сред(ХексСсылки, 1, 4)
		+ "-" + Сред(ХексСсылки, 5, 12));

КонецФункции

// Добавляет сообщение в существующее обращение.
//
// Параметры:
//   Идентификатор - Строка - GUID обращения;
//   Автор - Строка - "user" или "assistant";
//   Текст - Строка - текст сообщения.
//
Процедура ДобавитьСообщение(Идентификатор, Автор, Текст) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОбъектОбращения = ОбъектОбращенияПоИд(Идентификатор);
	Если ОбъектОбращения = Неопределено Тогда
		ВызватьИсключение "Обращение не найдено: " + Идентификатор;
	КонецЕсли;

	СтрокаСообщения = ОбъектОбращения.Сообщения.Добавить();
	СтрокаСообщения.Период = ТекущаяДатаСеанса();
	СтрокаСообщения.Автор = Автор;
	СтрокаСообщения.Текст = Текст;
	ОбъектОбращения.Записать();

КонецПроцедуры

// Записывает ответ оркестратора: сообщение от assistant, статус "Отвечено".
//
// Параметры:
//   Идентификатор - Строка - GUID обращения;
//   Текст - Строка - текст ответа.
//
Процедура ЗаписатьОтвет(Идентификатор, Текст) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОбъектОбращения = ОбъектОбращенияПоИд(Идентификатор);
	Если ОбъектОбращения = Неопределено Тогда
		ВызватьИсключение "Обращение не найдено: " + Идентификатор;
	КонецЕсли;

	СтрокаСообщения = ОбъектОбращения.Сообщения.Добавить();
	СтрокаСообщения.Период = ТекущаяДатаСеанса();
	СтрокаСообщения.Автор = "assistant";
	СтрокаСообщения.Текст = Текст;
	ОбъектОбращения.Статус = "Отвечено";
	ОбъектОбращения.Записать();

КонецПроцедуры

// Сохраняет файл из временного хранилища во вложения обращения.
//
// Параметры:
//   Идентификатор - Строка - GUID обращения;
//   ИмяФайла - Строка - имя файла с расширением;
//   АдресХранилища - Строка - адрес во временном хранилище.
//
Процедура СохранитьВложение(Идентификатор, ИмяФайла, АдресХранилища) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОбъектОбращения = ОбъектОбращенияПоИд(Идентификатор);
	Если ОбъектОбращения = Неопределено Тогда
		ВызватьИсключение "Обращение не найдено: " + Идентификатор;
	КонецЕсли;

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);

	СтрокаВложения = ОбъектОбращения.Вложения.Добавить();
	СтрокаВложения.ИмяФайла = ИмяФайла;
	СтрокаВложения.ТипСодержимого = ТипСодержимогоПоРасширению(ИмяФайла);
	СтрокаВложения.Данные = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	ОбъектОбращения.Записать();

КонецПроцедуры

// Возвращает обращения в статусе "Новое" для оркестратора.
//
// Возвращаемое значение:
//   Массив из Структура - id, subject, created, user, contextType, contextGuid,
//   contextLink, dossier, message, attachments.
//
Функция ОжидающиеОбращения() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Обращения.Ссылка КАК Ссылка,
		|	Обращения.Наименование КАК Наименование,
		|	Обращения.ДатаСоздания КАК ДатаСоздания,
		|	Обращения.ПользовательИмя КАК ПользовательИмя,
		|	Обращения.КонтекстТип КАК КонтекстТип,
		|	Обращения.КонтекстGUID КАК КонтекстGUID,
		|	Обращения.КонтекстСсылка КАК КонтекстСсылка,
		|	Обращения.Досье КАК Досье
		|ИЗ
		|	Справочник.AI_Обращения КАК Обращения
		|ГДЕ
		|	Обращения.Статус = &СтатусНовое
		|	И НЕ Обращения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Обращения.ДатаСоздания";
	Запрос.УстановитьПараметр("СтатусНовое", "Новое");

	Результат = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Новый Структура;
		Запись.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Запись.Вставить("subject", Выборка.Наименование);
		Запись.Вставить("created", Выборка.ДатаСоздания);
		Запись.Вставить("user", Выборка.ПользовательИмя);
		Запись.Вставить("contextType", Выборка.КонтекстТип);
		Запись.Вставить("contextGuid", Выборка.КонтекстGUID);
		Запись.Вставить("contextLink", Выборка.КонтекстСсылка);
		Запись.Вставить("dossier", Выборка.Досье);
		Запись.Вставить("message", ПервоеСообщение(Выборка.Ссылка));
		Запись.Вставить("attachments", СписокВложений(Выборка.Ссылка));
		Результат.Добавить(Запись);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает полные данные обращения с историей сообщений.
//
// Параметры:
//   Идентификатор - Строка - GUID обращения.
//
// Возвращаемое значение:
//   Неопределено - обращение не найдено;
//   Структура - id, subject, status, created, user, contextType, contextGuid,
//   contextLink, dossier, messages, attachments.
//
Функция ПолучитьОбращение(Идентификатор) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	СсылкаНаОбращение = СсылкаПоИдентификатору(Идентификатор);
	Если СсылкаНаОбращение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Сообщения = Новый Массив;
	Для Каждого СтрокаСообщения Из СсылкаНаОбращение.Сообщения Цикл
		Сообщение = Новый Структура;
		Сообщение.Вставить("date", СтрокаСообщения.Период);
		Сообщение.Вставить("author", СтрокаСообщения.Автор);
		Сообщение.Вставить("text", СтрокаСообщения.Текст);
		Сообщения.Добавить(Сообщение);
	КонецЦикла;

	Данные = Новый Структура;
	Данные.Вставить("id", Идентификатор);
	Данные.Вставить("subject", СсылкаНаОбращение.Наименование);
	Данные.Вставить("status", XMLСтрока(СсылкаНаОбращение.Статус));
	Данные.Вставить("created", СсылкаНаОбращение.ДатаСоздания);
	Данные.Вставить("user", СсылкаНаОбращение.ПользовательИмя);
	Данные.Вставить("contextType", СсылкаНаОбращение.КонтекстТип);
	Данные.Вставить("contextGuid", СсылкаНаОбращение.КонтекстGUID);
	Данные.Вставить("contextLink", СсылкаНаОбращение.КонтекстСсылка);
	Данные.Вставить("dossier", СсылкаНаОбращение.Досье);
	Данные.Вставить("messages", Сообщения);
	Данные.Вставить("attachments", СписокВложений(СсылкаНаОбращение));
	Возврат Данные;

КонецФункции

// Возвращает двоичные данные вложения обращения.
//
// Параметры:
//   Идентификатор - Строка - GUID обращения;
//   Индекс - Число - индекс строки в табличной части Вложения (с 0).
//
// Возвращаемое значение:
//   Неопределено - вложение не найдено;
//   Структура - name, mime, data (ДвоичныеДанные).
//
Функция ПолучитьВложение(Идентификатор, Индекс) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	СсылкаНаОбращение = СсылкаПоИдентификатору(Идентификатор);
	Если СсылкаНаОбращение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Индекс < 0 ИЛИ Индекс >= СсылкаНаОбращение.Вложения.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтрокаВложения = СсылкаНаОбращение.Вложения[Индекс];

	Вложение = Новый Структура;
	Вложение.Вставить("name", СтрокаВложения.ИмяФайла);
	Вложение.Вставить("mime", СтрокаВложения.ТипСодержимого);
	Вложение.Вставить("data", СтрокаВложения.Данные.Получить());
	Возврат Вложение;

КонецФункции

// Строит HTML истории чата для поля HTML-документа формы.
//
// Параметры:
//   Сообщения - Массив из Структура - см. ПолучитьОбращение(), ключ messages.
//
// Возвращаемое значение:
//   Строка - HTML документа.
//
Функция ИсторияHTML(Сообщения) Экспорт

	Части = Новый Массив;
	Части.Добавить("<html><head><meta charset=""utf-8""></head>"
		+ "<body style=""font-family:Segoe UI,Arial,sans-serif;font-size:13px;margin:8px;"">");

	Для Каждого Сообщение Из Сообщения Цикл
		ЭтоПользователь = (Сообщение.author = "user");
		ЦветФона = ?(ЭтоПользователь, "#e8f0fe", "#f1f3f4");
		Подпись = ?(ЭтоПользователь, "Вы", "AI");

		ТекстHTML = ЭкранироватьHTML(Сообщение.text);
		ТекстHTML = СтрЗаменить(ТекстHTML, Символы.ПС, "<br>");

		Части.Добавить("<div style=""margin:6px 0;padding:8px;border-radius:8px;background:"
			+ ЦветФона + ";"">"
			+ "<b>" + Подпись + "</b> <span style=""color:#888;font-size:11px;"">"
			+ Формат(Сообщение.date, "ДЛФ=DT") + "</span>"
			+ "<div style=""margin-top:4px;"">" + ТекстHTML + "</div></div>");
	КонецЦикла;

	Части.Добавить("</body></html>");
	Возврат СтрСоединить(Части);

КонецФункции

// Собирает автодосье обращения: окружение, версии, хвост журнала регистрации.
//
// Возвращаемое значение:
//   Строка - JSON с ключами configuration, platform, extensions, user, session, eventLog.
//
Функция СобратьДосье() Экспорт

	Досье = Новый Структура;

	Конфигурация = Новый Структура;
	Конфигурация.Вставить("name", Метаданные.Имя);
	Конфигурация.Вставить("version", Метаданные.Версия);
	Конфигурация.Вставить("synonym", Метаданные.Синоним);
	Досье.Вставить("configuration", Конфигурация);

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Досье.Вставить("platform", СистемнаяИнформация.ВерсияПриложения);

	Расширения = Новый Массив;
	Попытка
		Для Каждого Расширение Из РасширенияКонфигурации.Получить() Цикл
			ОписаниеРасширения = Новый Структура;
			ОписаниеРасширения.Вставить("name", Расширение.Имя);
			ОписаниеРасширения.Вставить("synonym", Расширение.Синоним);
			ОписаниеРасширения.Вставить("version", Расширение.Версия);
			ОписаниеРасширения.Вставить("active", Расширение.Активно);
			Расширения.Добавить(ОписаниеРасширения);
		КонецЦикла;
	Исключение
		Расширения.Добавить("error: " + ОписаниеОшибки());
	КонецПопытки;
	Досье.Вставить("extensions", Расширения);

	Пользователь = Новый Структура;
	Пользователь.Вставить("name", ИмяТекущегоПользователя());
	Попытка
		Пользователь.Вставить("fullName",
			ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя);
	Исключение
		Пользователь.Вставить("fullName", "");
	КонецПопытки;
	Досье.Вставить("user", Пользователь);

	Сеанс = Новый Структура;
	Сеанс.Вставить("number", НомерСеансаИнформационнойБазы());
	Сеанс.Вставить("runMode", Строка(ТекущийРежимЗапуска()));
	Досье.Вставить("session", Сеанс);

	Досье.Вставить("eventLog", ХвостЖурналаРегистрации());

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Досье);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Сохраняет двоичные данные во вложения обращения (вызов из формы чата).
//
// Параметры:
//   Идентификатор - Строка - GUID обращения;
//   ИмяФайла - Строка - имя файла с расширением;
//   ТипСодержимого - Строка - MIME-тип;
//   ДвоичныеДанные - ДвоичныеДанные - содержимое файла.
//
Процедура СохранитьВложениеДвоичные(Идентификатор, ИмяФайла, ТипСодержимого, ДвоичныеДанные) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ОбъектОбращения = ОбъектОбращенияПоИд(Идентификатор);
	Если ОбъектОбращения = Неопределено Тогда
		ВызватьИсключение "Обращение не найдено: " + Идентификатор;
	КонецЕсли;

	СтрокаВложения = ОбъектОбращения.Вложения.Добавить();
	СтрокаВложения.ИмяФайла = ИмяФайла;
	СтрокаВложения.ТипСодержимого = ТипСодержимого;
	СтрокаВложения.Данные = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	ОбъектОбращения.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяТекущегоПользователя()

	Попытка
		Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Функция СсылкаПоИдентификатору(Идентификатор)

	Попытка
		УИД = Новый УникальныйИдентификатор(Идентификатор);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	СсылкаНаОбращение = Справочники.AI_Обращения.ПолучитьСсылку(УИД);

	Если СсылкаНаОбращение.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		// Обращение к реквизиту через ссылку проверяет существование объекта.
		Проверка = СсылкаНаОбращение.Наименование;
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Если Проверка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат СсылкаНаОбращение;

КонецФункции

Функция ОбъектОбращенияПоИд(Идентификатор)

	СсылкаНаОбращение = СсылкаПоИдентификатору(Идентификатор);
	Если СсылкаНаОбращение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		// Для несуществующего GUID ПолучитьОбъект возвращает Неопределено,
		// а от пустой ссылки бросает «Элемент не выбран» — оба случая = «не найдено».
		ОбъектОбращения = СсылкаНаОбращение.ПолучитьОбъект();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Возврат ОбъектОбращения;

КонецФункции

Функция ПервоеСообщение(СсылкаНаОбращение)

	Для Каждого СтрокаСообщения Из СсылкаНаОбращение.Сообщения Цикл
		Если СтрокаСообщения.Автор = "user" Тогда
			Возврат СтрокаСообщения.Текст;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

Функция СписокВложений(СсылкаНаОбращение)

	Вложения = Новый Массив;
	Для Каждого СтрокаВложения Из СсылкаНаОбращение.Вложения Цикл
		Вложение = Новый Структура;
		Вложение.Вставить("name", СтрокаВложения.ИмяФайла);
		Вложение.Вставить("mime", СтрокаВложения.ТипСодержимого);
		Вложения.Добавить(Вложение);
	КонецЦикла;

	Возврат Вложения;

КонецФункции

Функция ХвостЖурналаРегистрации()

	ЗаписиЖурнала = Новый Массив;

	Попытка
		Уровни = Новый Массив;
		Уровни.Добавить(УровеньЖурналаРегистрации.Ошибка);
		Уровни.Добавить(УровеньЖурналаРегистрации.Предупреждение);

		ОтборЖурнала = Новый Структура;
		ОтборЖурнала.Вставить("Уровень", Уровни);
		ОтборЖурнала.Вставить("ДатаНачала", ТекущаяДатаСеанса() - 3600);

		ИмяПользователя = ИмяТекущегоПользователя();
		Если Не ПустаяСтрока(ИмяПользователя) Тогда
			ОтборЖурнала.Вставить("Пользователь", ИмяПользователя);
		КонецЕсли;

		ТаблицаЖурнала = Новый ТаблицаЗначений;
		ВыгрузитьЖурналРегистрации(ТаблицаЖурнала, ОтборЖурнала,
			"Дата,Уровень,Событие,Комментарий,ПредставлениеДанных", 20);

		Для Каждого СтрокаЖурнала Из ТаблицаЖурнала Цикл
			ЗаписьЖурнала = Новый Структура;
			ЗаписьЖурнала.Вставить("date", СтрокаЖурнала.Дата);
			ЗаписьЖурнала.Вставить("level", Строка(СтрокаЖурнала.Уровень));
			ЗаписьЖурнала.Вставить("event", СтрокаЖурнала.Событие);
			ЗаписьЖурнала.Вставить("comment", СтрокаЖурнала.Комментарий);
			ЗаписиЖурнала.Добавить(ЗаписьЖурнала);
		КонецЦикла;
	Исключение
		ЗаписиЖурнала.Добавить("error: " + ОписаниеОшибки());
	КонецПопытки;

	Возврат ЗаписиЖурнала;

КонецФункции

Функция ТипСодержимогоПоРасширению(ИмяФайла)

	ПозицияТочки = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если ПозицияТочки = 0 Тогда
		Возврат "application/octet-stream";
	КонецЕсли;

	Расширение = НРег(Сред(ИмяФайла, ПозицияТочки + 1));

	Если Расширение = "png" Тогда
		Возврат "image/png";
	ИначеЕсли Расширение = "jpg" ИЛИ Расширение = "jpeg" Тогда
		Возврат "image/jpeg";
	ИначеЕсли Расширение = "gif" Тогда
		Возврат "image/gif";
	ИначеЕсли Расширение = "bmp" Тогда
		Возврат "image/bmp";
	ИначеЕсли Расширение = "pdf" Тогда
		Возврат "application/pdf";
	ИначеЕсли Расширение = "txt" ИЛИ Расширение = "log" Тогда
		Возврат "text/plain";
	Иначе
		Возврат "application/octet-stream";
	КонецЕсли;

КонецФункции

Функция ЭкранироватьHTML(Текст)

	Результат = СтрЗаменить(Текст, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Возврат Результат;

КонецФункции

#КонецОбласти
